[A_Dungeon_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在本城建造全新建筑的场所。\n每天提供 500 %ICON_GOLD 黄金。"

[A_Dungeon_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[A_Dungeon_CityHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[A_Dungeon_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[A_Dungeon_Fortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[A_Dungeon_Fortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[A_Dungeon_Fortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[A_Dungeon_DarkWatch H7TownTower]
mName="黑暗凝视"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[A_Dungeon_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在本城镇提供7个随机的1阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Dungeon_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在本城镇提供6个随机的2阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Dungeon_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在本城镇提供4个随机的3阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Dungeon_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在本城镇提供2个随机的4阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Dungeon_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="提供招募新英雄和战败英雄的选项。新英雄的选择在每周开始时更换。"

[A_Dungeon_HallsOfTheUnseenHand H7TownDwelling]
mName="无影之手大厅"
mDesc="核心生物住所。\n每周可招募20个刺客。"

[A_Dungeon_HallsOfTheBlackHeart H7TownDwelling]
mName="黑暗之心大厅"
mDesc="核心生物住所升级。\n可招募并将刺客升级为幽影。\n（基础产量：20/周）"

[A_Dungeon_AssassinsGuild H7TownGrowthEnhancer]
mName="刺客工会"
mDesc="核心生物住所升级。\n每周刺客或幽影的产量+10。"

[A_Dungeon_ShadowArena H7TownDwelling]
mName="暗影竞技场"
mDesc="核心生物住所。\n每周可招募19个追踪者。"

[A_Dungeon_ShadowRing H7TownDwelling]
mName="暗影斗场"
mDesc="核心生物住所升级。\n可招募并将追踪者升级为追猎者。\n（基础产量：19/周）"

[A_Dungeon_ShootingRange H7TownGrowthEnhancer]
mName="训练场"
mDesc="核心生物住所升级。\n每周追踪者或追猎者的产量+9。"

[A_Dungeon_CradleOfStone H7TownDwelling]
mName="岩石摇篮"
mDesc="核心生物住所。\n每周可招募9个穴居人。"

[A_Dungeon_ChthonianAbyss H7TownDwelling]
mName="魔人深渊"
mDesc="核心生物住所升级。\n可招募并将穴居人升级为冥魔。\n（基础产量：9/周）"

[A_Dungeon_UnfathomableCaves H7TownGrowthEnhancer]
mName="无底岩洞"
mDesc="核心生物住所升级。\n每周穴居人或冥魔的产量+5。"

[A_Dungeon_LakeOfStilledVoices H7TownDwelling]
mName="寂音之湖"
mDesc="精英生物住所。\n每周可招募6个美杜莎。"

[A_Dungeon_FrozenStatuary H7TownDwelling]
mName="霜冻雕像"
mDesc="精英生物住所升级。\n可招募并将美杜莎升级为美杜莎女巫。\n（基础产量：6/周）"

[A_Dungeon_SnakeTower H7TownGrowthEnhancer]
mName="蛇塔"
mDesc="精英生物住所升级。\n每周美杜莎或美杜莎女巫的产量+6。"

[A_Dungeon_StriderForge H7TownDwelling]
mName="挺进者铸厂"
mDesc="精英生物住所。\n每周可招募5个挺进者。"

[A_Dungeon_SoullessForge H7TownDwelling]
mName="失魂熔炉"
mDesc="精英生物住所升级。\n可招募并将挺进者升级为无魂者。\n（基础产量：5/周）"

[A_Dungeon_ShadowsteelPool H7TownGrowthEnhancer]
mName="影钢池"
mDesc="精英生物住所升级。\n每周挺进者/无魂者或蝎狮/毒蝎狮的产量+5。"

[A_Dungeon_Maze H7TownDwelling]
mName="困惑迷境"
mDesc="精英生物住所。\n每周可招募2个牛头怪。"

[A_Dungeon_Labyrinth H7TownDwelling]
mName="无尽密境"
mDesc="核心生物住所升级。\n可招募并将牛头怪升级为牛头怪守卫。\n（基础产量：2/周）"

[A_Dungeon_AltarOfBrokenChains H7TownGrowthEnhancer]
mName="破枷祭坛"
mDesc="精英生物住所升级。\n每周牛头怪或牛头怪守卫的产量+2。"

[A_Dungeon_HissingTemple H7TownDwelling]
mName="嘶鸣神殿"
mDesc="冠军生物住所。\n每周可招募2个洞穴九头蛇。"

[A_Dungeon_RattlingTemple H7TownDwelling]
mName="恐惧神庙"
mDesc="冠军生物住所升级。\n可招募并将洞穴九头蛇升级为黑暗九头蛇。\n（基础产量：2/周）"

[A_Dungeon_DragonSpire H7TownDwelling]
mName="飞龙尖塔"
mDesc="冠军生物住所。\n每周可招募2个影龙。"

[A_Dungeon_DragonPinnacle H7TownDwelling]
mName="飞龙山峰"
mDesc="冠军生物住所升级。\n可招募并将影龙升级为黑龙。\n（基础产量：2/周）"

[A_Dungeon_chambre_Shadow_emperor H7TownDwelling]
mName="隐藏公会"
mDesc="精英生物住所。\n可招募深渊使者。\n可使用"全部招募"功能招募。\n（基础产量：4/周）"

[A_Dungeon_chambre_elite_strong H7TownDwelling]
mName="遗忘执政官熔炉"
mDesc="冠军生物住所。\n可招募遗忘执政官。\n可使用"全部招募"功能招募。\n（基础产量：1/周）"

[A_Dungeon_ChamberOfWhispers H7TownUtilityUnitDwelling]
mName="低语之室"
mDesc="战争单位生产。\n提供购买无面者的选项。"

[A_Dungeon_PillarOfEyes H7TownUtilityUnitDwelling]
mName="魔眼之柱"
mDesc="战争单位生产。\n提供购买暗影潜伏者的选项。"

[A_Dungeon_Black_Market H7BlackMarket]
mName="黑市"
mDesc="每天提供250 %icon_gold 黄金和1单位 %icon_wood 木材。"

[A_Dungeon_BlackMarket H7TownBuilding]
mName="黑市"
mDesc="每天提供250 %icon_gold 黄金和1单位 %icon_wood 木材。"

[A_Dungeon_SpiesGuild H7TownSpiesGuild]
mName="密探公会"
mDesc="城镇获得一个额外的间谍。使间谍能够执行掠夺任务：\n掠夺目标玩家的随机资源点。"

[A_Dungeon_SoulvenomCrucible H7TownBuilding]
mName="灵魂毒液炉"
mDesc="在此城镇控制区域内你的英雄的所有战斗中，在敌方生物回合开始时对其造成40 %icon_earth 土系伤害，持续3回合。"

[A_Dungeon_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有拜访本城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄在这是最近的可用城镇时能够返回此城镇。"

[A_Dungeon_ChthonianDeposit H7TownBuilding]
mName="冥魔矿坑"
mDesc="每天提供2 %icon_Ore 矿石。"

[A_Dungeon_ThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供支付获取对手信息的选项。"

[A_Dungeon_OverlookTower H7TownBuilding]
mName="眺望之塔"
mDesc="拜访英雄在接下来的3场战斗中获得+5 %icon_initiative 主动性。"

[A_Dungeon_Moat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。\n踏入其中的敌方生物将被中断并获得无尽痛苦效果。"

[A_Dungeon_HallOfIntrigue H7TownHallOfIntrigue]
mName="密谋大厅"
mDesc="使间谍能够执行"破坏"任务：\n破坏目标玩家的随机城镇住所，使其下周产量减半。"

[A_Dungeon_Marketplace H7TownMarketplace]
mName="集市"
mDesc="提供交易资源的选项。"

[A_Dungeon_ShadowsteelRefinery H7TownBuilding]
mName="影钢精炼厂"
mDesc="每天提供1 %icon_Shadowsteel 影钢。"

[A_Dungeon_MarkOfMalassa H7TownTearOfAsha]
mName="暗龙之印"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n间谍可以破坏和掠夺两个额外目标。"

[dungeonbuildingabilities.A_Dungeon_OverlookTower_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[dungeonbuildingabilities.A_Dungeon_OverlookTower_BuffHero H7BaseBuff]
mName="眺望之塔"
mTooltip="接下来的 %durnow 场战斗中，友方生物获得 %buff1.buff.stat %buff1.buff.stat.icon 主动性。"

[dungeonbuildingabilities.A_Dungeon_SoulvenomCrucible_BuffHero H7BaseBuff]
mName="灵魂毒液炉"
mTooltip="在当前控制区域内，在敌方生物回合开始时对其造成 %buff1.buff.d.min %buff1.buff.d.icon 土系伤害，持续 %buff1.buff.durini 回合。"

[dungeonbuildingabilities.A_Dungeon_SoulvenomCrucible_BuffCreature H7BaseBuff]
mName="中毒"
mTooltip="在生物回合开始时对其造成 %d.min %d.icon 土系伤害。\n持续 %durnow 回合。"

[dungeonbuildingabilities.A_Dungeon_OverlookTower_BuffCreature H7BaseBuff]
mName="眺望之塔"
mTooltip="%stat %stat.icon 主动性直到战斗结束。"

[dungeonbuildingabilities.A_Dungeon_MarkOfMalassa_Ability H7BaseAbility]
mName="暗龙之印"
mTooltip="间谍可以破坏和掠夺两个额外目标。"

[dungeonbuildingabilities.A_Dungeon_MarkOfMalassa_PlayerBuff H7BaseBuff]
mName="暗龙之印"
mTooltip="间谍可以破坏和掠夺两个额外目标。"

[dungeonbuildingabilities.A_Dungeon_MarkOfMalassa_TownBuff H7BaseBuff]
mName="暗龙之印"
mTooltip=""

[dungeonbuildingabilities.A_Dungeon_SoulvenomCrucible_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

7.5_mod : 

新增第8单位槽选项
新增黑市结构以获取额外资源

v1.30

新增替代单位 - 蝎狮/毒蝎狮，以及蝎狮和挺进者的隐藏能力

v1.37：

修正塔楼描述以说明防守者属性增益
进行了许多修正和调整，使各城堡的描述更加一致和正确